Repository: Toby-Hacker/toby-portofolio
Catalog: lib/l10n/app_*.arb
Languages: fr

# nav_home
source: Home
fr: Accueil

# nav_case_studies
source: Case Studies
fr: Études de cas

# nav_testimonials
source: Testimonials
fr: Témoignages

# nav_recent_work
source: Recent work
fr: Travaux récents

# nav_get_in_touch
source: Get In Touch
fr: Contact

# hero_title
source: Your Name Here
fr: Votre nom ici

# hero_intro
source: Intro text: Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua.
fr: Texte d’intro : Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua.

# hero_cta
source: Let’s get started
fr: Commençons

# hero_worked_with
source: Worked with
fr: Ils m’ont fait confiance

# case_studies_title
source: Case Studies
fr: Études de cas

# case_studies_subtitle
source: Some of the projects I’ve worked on, showing how I approach real problems and build practical solutions.
fr: Quelques projets sur lesquels j’ai travaillé, montrant comment j’aborde de vrais problèmes et construis des solutions concrètes.

# case_study_view
source: View case study
fr: Voir l’étude de cas

# testimonials_title
source: Testimonials
fr: Témoignages

# testimonials_subtitle
source: A few words from people I’ve had the chance to work with.
fr: Quelques mots de personnes avec qui j’ai eu l’occasion de travailler.

# recent_work_title
source: Recent Work
fr: Travaux récents

# recent_work_subtitle
source: A selection of my most recent work.
fr: Une sélection de mes travaux récents.

# recent_work_know_more
source: Know more
fr: En savoir plus

# contact_title
source: Get In Touch
fr: Contact

# contact_subtitle
source: Let’s talk about your project.
fr: Parlons de votre projet.

# contact_email_hint
source: Please enter your email
fr: Veuillez saisir votre email

# contact_mobile_label
source: Mobile
fr: Téléphone

# contact_mobile_hint
source: Enter mobile
fr: Entrez votre numéro

# contact_message_hint
source: Enter your message
fr: Entrez votre message

# contact_submit
source: Submit
fr: Envoyer

# case_details_not_found
source: Case study not found
fr: Étude de cas introuvable

# case_details_view_live
source: View live
fr: Voir en ligne

# case_details_project_overview_title
source: Project Overview
fr: Aperçu du projet

# case_details_project_overview_subtitle
source: A quick look at the problem, goals, and scope of the project.
fr: Un aperçu du problème, des objectifs et du périmètre.

# case_details_problem_title
source: Problem
fr: Problème

# case_details_problem_body
source: Legacy tooling slowed down onboarding and reporting for internal teams.
fr: Les outils hérités ralentissaient l’onboarding et le reporting.

# case_details_goal_title
source: Goal
fr: Objectif

# case_details_goal_body
source: Deliver a faster, mobile-first experience with reliable data syncing.
fr: Offrir une expérience mobile plus rapide avec une synchro fiable.

# case_details_role_title
source: Role & Timeline
fr: Rôle & calendrier

# case_details_role_body
source: Full-stack mobile developer • 8 weeks • 2 teammates
fr: Développeur mobile full‑stack • 8 semaines • 2 coéquipiers

# case_details_deliverables_title
source: Deliverables
fr: Livrables

# case_details_deliverables_body
source: iOS/Android apps, admin dashboard, analytics, and CI/CD.
fr: Apps iOS/Android, dashboard admin, analytics et CI/CD.

# case_details_approach_title
source: Approach
fr: Approche

# case_details_approach_subtitle
source: How the project moved from discovery to delivery.
fr: Du discovery à la livraison.

# case_details_step_1_title
source: Discovery
fr: Découverte

# case_details_step_1_body
source: User interviews + flow mapping.
fr: Interviews utilisateurs et cartographie des flux.

# case_details_step_2_body
source: Wireframes and UI kit for fast build.
fr: Wireframes et UI kit pour accélérer.

# case_details_step_3_body
source: Flutter app + backend services.
fr: App Flutter + services backend.

# case_details_step_4_title
source: Launch
fr: Lancement

# case_details_step_4_body
source: Monitoring, analytics, and handoff.
fr: Monitoring, analytics et passation.

# case_details_highlights_title
source: Highlights
fr: Points clés

# case_details_highlights_subtitle
source: Key features delivered for the project.
fr: Fonctionnalités livrées pour le projet.

# case_details_tech_stack_title
source: Tech Stack
fr: Stack technique

# case_details_tech_stack_subtitle
source: Tools and frameworks used in the build.
fr: Outils et frameworks utilisés.

# case_details_challenges_title
source: Challenges & Solutions
fr: Défis & solutions

# case_details_challenges_subtitle
source: Key tradeoffs and how they were resolved.
fr: Principaux arbitrages et solutions.

# case_details_challenge_1_title
source: Offline reliability
fr: Fiabilité hors‑ligne

# case_details_challenge_1_body
source: Added local caching with queued sync when connectivity returns.
fr: Cache local avec synchronisation différée.

# case_details_challenge_2_title
source: Performance under load
fr: Performance sous charge

# case_details_challenge_2_body
source: Optimized API responses and reduced payload size by 35%.
fr: APIs optimisées et payload réduit de 35 %.

# case_details_outcome_title
source: Outcome
fr: Résultats

# case_details_outcome_subtitle
source: Results delivered after launch.
fr: Résultats après lancement.

# case_details_quote
source: “Great collaboration and execution. The product is faster and more reliable than before.”
fr: « Super collaboration et exécution. Le produit est plus rapide et plus fiable. »

# case_details_next_title
source: Next Case Study
fr: Étude de cas suivante

# case_details_next_subtitle
source: Explore another project in the portfolio.
fr: Découvrez un autre projet.

# case_details_metric_users_label
source: Users
fr: Utilisateurs

# case_details_metric_uptime_label
source: Uptime
fr: Disponibilité

# case_details_metric_revenue_label
source: Revenue
fr: Revenus

# case_details_metric_retention_label
source: Retention
fr: Rétention

# case_details_metric_processing_time_label
source: Processing time
fr: Temps de traitement

# recent_details_not_found
source: Recent work not found
fr: Travail introuvable

# recent_details_visit_project
source: Visit project
fr: Voir le projet

# recent_details_project_overview_title
source: Project Overview
fr: Aperçu du projet

# recent_details_project_overview_subtitle
source: A quick summary of the work delivered and why it mattered.
fr: Résumé du travail livré et de son impact.

# recent_details_scope_title
source: Scope
fr: Périmètre

# recent_details_scope_body
source: End-to-end delivery with focus on mobile experience.
fr: Livraison de bout en bout avec focus mobile.

# recent_details_role_title
source: Role
fr: Rôle

# recent_details_role_body
source: Full-stack mobile development and release planning.
fr: Développement mobile full‑stack et planification release.

# recent_details_timeline_title
source: Timeline
fr: Calendrier

# recent_details_timeline_body
source: 6 weeks from discovery to launch.
fr: 6 semaines de la découverte au lancement.

# recent_details_deliverables_title
source: Deliverables
fr: Livrables

# recent_details_deliverables_body
source: Mobile apps, backend services, and analytics.
fr: Apps mobiles, services backend et analytics.

# recent_details_highlights_title
source: Highlights
fr: Points clés

# recent_details_highlights_subtitle
source: Key wins and improvements from this work.
fr: Améliorations et gains majeurs.

# recent_details_highlight_1
source: Shipped new flows for onboarding and core features.
fr: Nouveaux parcours d’onboarding et fonctionnalités clés.

# recent_details_highlight_2
source: Improved performance and reliability metrics.
fr: Amélioration des performances et de la fiabilité.

# recent_details_highlight_3
source: Reduced support tickets with clearer UX.
fr: Moins de tickets support grâce à un UX plus clair.

# recent_details_tech_stack_title
source: Tech Stack
fr: Stack technique

# recent_details_tech_stack_subtitle
source: Tools and frameworks used in the build.
fr: Outils et frameworks utilisés.

# recent_details_outcome_title
source: Outcome
fr: Résultats

# recent_details_outcome_subtitle
source: Results delivered after launch.
fr: Résultats après lancement.

# recent_details_metric_retention_label
source: Retention
fr: Rétention

# recent_details_metric_latency_label
source: Latency
fr: Latence

# recent_details_metric_crash_rate_label
source: Crash rate
fr: Taux de crash

# recent_details_back_home
source: Back to home
fr: Retour à l’accueil
